This is gdb.info, produced by makeinfo version 6.7 from gdb.texinfo.

Copyright (C) 1988-2022 Free Software Foundation, Inc.

   Permission is granted to copy, distribute and/or modify this document
under the terms of the GNU Free Documentation License, Version 1.3 or
any later version published by the Free Software Foundation; with the
Invariant Sections being "Free Software" and "Free Software Needs Free
Documentation", with the Front-Cover Texts being "A GNU Manual," and
with the Back-Cover Texts as in (a) below.

   (a) The FSF's Back-Cover Text is: "You are free to copy and modify
this GNU Manual.  Buying copies from GNU Press supports the FSF in
developing GNU and promoting software freedom."
INFO-DIR-SECTION Software development
START-INFO-DIR-ENTRY
* Gdb: (gdb).                     The GNU debugger.
* gdbserver: (gdb) Server.        The GNU debugging server.
END-INFO-DIR-ENTRY

   This file documents the GNU debugger GDB.

   This is the Tenth Edition, of 'Debugging with GDB: the GNU
Source-Level Debugger' for GDB (GDB) Version 11.2.

   Copyright (C) 1988-2022 Free Software Foundation, Inc.

   Permission is granted to copy, distribute and/or modify this document
under the terms of the GNU Free Documentation License, Version 1.3 or
any later version published by the Free Software Foundation; with the
Invariant Sections being "Free Software" and "Free Software Needs Free
Documentation", with the Front-Cover Texts being "A GNU Manual," and

     expression is a compound data type, such as 'struct' or 'class',
     'whatis' never prints their fields or methods.  It just prints the
     'struct'/'class' name (a.k.a. its "tag").  If you want to see the
     members of such a compound data type, use 'ptype'.

     If ARG is a type name that was defined using 'typedef', 'whatis'
     "unrolls" only one level of that 'typedef'.  Unrolling means that
     'whatis' will show the underlying type used in the 'typedef'
     declaration of ARG.  However, if that underlying type is also a
     'typedef', 'whatis' will not unroll it.

     For C code, the type names may also have the form 'class
     CLASS-NAME', 'struct STRUCT-TAG', 'union UNION-TAG' or 'enum
     ENUM-TAG'.

     FLAGS can be used to modify how the type is displayed.  Available
     flags are:

     'r'
          Display in "raw" form.  Normally, GDB substitutes template
          parameters and typedefs defined in a class when printing the
          class' members.  The '/r' flag disables this.

     'm'
          Do not print methods defined in the class.

     'M'
          Print methods defined in the class.  This is the default, but
          the flag exists in case you change the default with 'set print
          type methods'.

     't'
          Do not print typedefs defined in the class.  Note that this
          controls whether the typedef definition itself is printed, not
          whether typedef names are substituted when printing other
          types.

     'T'
          Print typedefs defined in the class.  This is the default, but
          the flag exists in case you change the default with 'set print
          type typedefs'.

     'o'
          Print the offsets and sizes of fields in a struct, similar to
          what the 'pahole' tool does.  This option implies the '/tm'
          flags.

     'x'
          Use hexadecimal notation when printing offsets and sizes of
          fields in a struct.

     'd'
          Use decimal notation when printing offsets and sizes of fields
          in a struct.

          For example, given the following declarations:

               struct tuv
               {
                 int a1;
                 char *a2;
                 int a3;
               };

               struct xyz
               {
                 int f1;
                 char f2;
                 void *f3;
                 struct tuv f4;
               };

               union qwe
               {
                 struct tuv fff1;
                 struct xyz fff2;
               };

               struct tyu
               {
                 int a1 : 1;
                 int a2 : 3;
                 int a3 : 23;
                 char a4 : 2;
                 int64_t a5;
                 int a6 : 5;
                 int64_t a7 : 3;
               };

          Issuing a 'ptype /o struct tuv' command would print:

               (gdb) ptype /o struct tuv
               /* offset      |    size */  type = struct tuv {
               /*      0      |       4 */    int a1;
               /* XXX  4-byte hole      */
               /*      8      |       8 */    char *a2;
               /*     16      |       4 */    int a3;

                                              /* total size (bytes):   24 */
                                            }

          Notice the format of the first column of comments.  There, you
          can find two parts separated by the '|' character: the
          _offset_, which indicates where the field is located inside
          the struct, in bytes, and the _size_ of the field.  Another
          interesting line is the marker of a _hole_ in the struct,
          indicating that it may be possible to pack the struct and make
          it use less space by reorganizing its fields.

          It is also possible to print offsets inside an union:

               (gdb) ptype /o union qwe
               /* offset      |    size */  type = union qwe {
               /*                    24 */    struct tuv {
               /*      0      |       4 */        int a1;
               /* XXX  4-byte hole      */
               /*      8      |       8 */        char *a2;
               /*     16      |       4 */        int a3;

                                                  /* total size (bytes):   24 */
                                              } fff1;
               /*                    40 */    struct xyz {
               /*      0      |       4 */        int f1;
               /*      4      |       1 */        char f2;
               /* XXX  3-byte hole      */
               /*      8      |       8 */        void *f3;
               /*     16      |      24 */        struct tuv {
               /*     16      |       4 */            int a1;
               /* XXX  4-byte hole      */
               /*     24      |       8 */            char *a2;
               /*     32      |       4 */            int a3;

                                                      /* total size (bytes):   24 */
                                                  } f4;

                                                  /* total size (bytes):   40 */
                                              } fff2;

                                              /* total size (bytes):   40 */
                                            }

          In this case, since 'struct tuv' and 'struct xyz' occupy the
          same space (because we are dealing with an union), the offset
          is not printed for them.  However, you can still examine the
          offset of each of these structures' fields.

          Another useful scenario is printing the offsets of a struct
          containing bitfields:

               (gdb) ptype /o struct tyu
               /* offset      |    size */  type = struct tyu {
               /*      0:31   |       4 */    int a1 : 1;
               /*      0:28   |       4 */    int a2 : 3;
               /*      0: 5   |       4 */    int a3 : 23;
               /*      3: 3   |       1 */    signed char a4 : 2;
               /* XXX  3-bit hole       */
               /* XXX  4-byte hole      */
               /*      8      |       8 */    int64_t a5;
               /*     16: 0   |       4 */    int a6 : 5;
               /*     16: 5   |       8 */    int64_t a7 : 3;
               /* XXX  7-byte padding   */

                                              /* total size (bytes):   24 */
                                            }

          Note how the offset information is now extended to also
          include the first bit of the bitfield.

'ptype[/FLAGS] [ARG]'
     'ptype' accepts the same arguments as 'whatis', but prints a
     detailed description of the type, instead of just the name of the
     type.  *Note Expressions: Expressions.

     Contrary to 'whatis', 'ptype' always unrolls any 'typedef's in its
     argument declaration, whether the argument is a variable,
     expression, or a data type.  This means that 'ptype' of a variable
     or an expression will not print literally its type as present in
     the source code--use 'whatis' for that.  'typedef's at the pointer
     or reference targets are also unrolled.  Only 'typedef's of fields,
